In [35]:
from pandas import DataFrame 
import numpy as np
import pandas as pd

In [36]:
dept = {'dept_name':['EEE','CSE','ECE','ME','CE','BME','MSE'], 'estb_year':[1950,1972,1973,1937,1968,1999,1987]}
d_frame = pd.DataFrame(dept)

In [37]:
d_frame

  dept_name  estb_year
0       EEE       1950
1       CSE       1972
2       ECE       1973
3        ME       1937
4        CE       1968
5       BME       1999
6       MSE       1987

In [38]:
d_frame.head()

  dept_name  estb_year
0       EEE       1950
1       CSE       1972
2       ECE       1973
3        ME       1937
4        CE       1968

In [39]:
data2 = pd.DataFrame(dept, columns = ['estb_year', 'dept_name', 'Q-index'], index = ['i', 'ii', 'iii', 'iv', 'v', 'vi', 'vii'])
data2

     estb_year dept_name Q-index
i         1950       EEE     NaN
ii        1972       CSE     NaN
iii       1973       ECE     NaN
iv        1937        ME     NaN
v         1968        CE     NaN
vi        1999       BME     NaN
vii       1987       MSE     NaN

In [40]:
data2['dept_name']

i      EEE
ii     CSE
iii    ECE
iv      ME
v       CE
vi     BME
vii    MSE
Name: dept_name, dtype: object

In [41]:
data2['estb_year']

i      1950
ii     1972
iii    1973
iv     1937
v      1968
vi     1999
vii    1987
Name: estb_year, dtype: int64

In [42]:
data2.columns

Index(['estb_year', 'dept_name', 'Q-index'], dtype='object')

In [43]:
data2.loc['i']

estb_year    1950
dept_name     EEE
Q-index       NaN
Name: i, dtype: object

In [44]:
data2['Q-index'] = np.arange(7)

In [45]:
data2

     estb_year dept_name  Q-index
i         1950       EEE        0
ii        1972       CSE        1
iii       1973       ECE        2
iv        1937        ME        3
v         1968        CE        4
vi        1999       BME        5
vii       1987       MSE        6

In [70]:
# insert Series into DataFrame
val = pd.Series([1, 0.8, .5], index = ['i','ii','iii'])
data2['Q-index'] = val

In [72]:
data2['test_columns'] = data2.dept_name == 'EEE'

In [73]:
data2

     estb_year dept_name  Q-index  test_columns
i         1950       EEE      1.0          True
ii        1972       CSE      0.8         False
iii       1973       ECE      0.5         False
iv        1937        ME      NaN         False
v         1968        CE      NaN         False
vi        1999       BME      NaN         False
vii       1987       MSE      NaN         False

In [74]:
del data2['test_columns']

In [75]:
data2.columns

Index(['estb_year', 'dept_name', 'Q-index'], dtype='object')

In [84]:
# Nested DataFrame in pandas
test_dataset = {"EEE": {'Major':'Electrical', 'Minor': 'Electronics'}, "CSE": {"Major": "Artificial Intelligence", 'Minor':"Algorithm Complexity"},
               "ME": {"Major": "Robotics Control"}}

In [85]:
test_data = pd.DataFrame(test_dataset)
test_data

               EEE                      CSE                ME
Major   Electrical  Artificial Intelligence  Robotics Control
Minor  Electronics     Algorithm Complexity               NaN

In [86]:
test_data.T

                       Major                 Minor
EEE               Electrical           Electronics
CSE  Artificial Intelligence  Algorithm Complexity
ME          Robotics Control                   NaN

In [90]:
test_data.index.name = "Choise"; test_data.columns.name = "Dept"

In [91]:
test_data

Dept            EEE                      CSE                ME
Choise
Major    Electrical  Artificial Intelligence  Robotics Control
Minor   Electronics     Algorithm Complexity               NaN

In [92]:
test_data.T

Choise                    Major                 Minor
Dept
EEE                  Electrical           Electronics
CSE     Artificial Intelligence  Algorithm Complexity
ME             Robotics Control                   NaN

In [94]:
test_data.values

array([['Electrical', 'Artificial Intelligence', 'Robotics Control'],
       ['Electronics', 'Algorithm Complexity', nan]], dtype=object)